; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v12 ?v7)
             (pred_7 ?v4 ?v11)
             (pred_3 ?v12 ?v11)
             (pred_4 ?v1 ?v12 )
	     (pred_8 ?v12)
             (pred_9 ?v13)
             (pred_1 ?v4)
             (pred_12 ?v11)
             (pred_10 ?v12)
             (pred_2 ?v4)
             (pred_6 ?v12)
             (pred_11 ))



(:action op_5
:parameters (?v5 ?v2 ?v3 ?v6)
:precondition (and (pred_9 ?v5) (pred_9 ?v2) (pred_1 ?v3) (pred_12 ?v6)
          (pred_5 ?v5 ?v2) (pred_7 ?v3 ?v6)
                   (pred_3 ?v2 ?v6) (pred_8 ?v5) 
                   (pred_10 ?v2) (pred_2 ?v3))
:effect (and  (pred_6 ?v2) (not (pred_10 ?v2))))


(:action op_4
:parameters (?v5 ?v9)
:precondition (and (pred_9 ?v5) (pred_9 ?v9)
               (pred_8 ?v5) (pred_5 ?v5 ?v9) (pred_6 ?v9))
:effect (and (pred_8 ?v9) (not (pred_8 ?v5))))

(:action op_1
:parameters (?v5 ?v3)
:precondition (and (pred_9 ?v5) (pred_1 ?v3) 
                  (pred_8 ?v5) (pred_4 ?v3 ?v5) (pred_11 ))
:effect (and (pred_2 ?v3)
   (not (pred_4 ?v3 ?v5)) (not (pred_11 ))))


(:action op_2
:parameters (?v5 ?v10 ?v8)
:precondition (and (pred_9 ?v5) (pred_1 ?v10) (pred_1 ?v8)
                  (pred_8 ?v5) (pred_2 ?v8) (pred_4 ?v10 ?v5))
:effect (and (pred_2 ?v10) (pred_4 ?v8 ?v5)
        (not (pred_2 ?v8)) (not (pred_4 ?v10 ?v5))))

(:action op_3
:parameters (?v5 ?v3)
:precondition (and (pred_9 ?v5) (pred_1 ?v3) 
                  (pred_8 ?v5) (pred_2 ?v3))
:effect (and (pred_11 ) (pred_4 ?v3 ?v5) (not (pred_2 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_01 obj_26 obj_19 obj_21 obj_08 obj_11 obj_03 obj_22 obj_23 obj_24 obj_25 obj_31 obj_07 obj_29 obj_27 obj_16 obj_28 obj_14 obj_15 obj_06 obj_10 obj_04 obj_09 obj_20
    obj_12 obj_13 obj_05
    obj_18 obj_17 obj_30
    )

    (:init
       (pred_11)

       (pred_9 obj_02)
       (pred_9 obj_01)
       (pred_9 obj_26)
       (pred_9 obj_19)
       (pred_9 obj_21)
       (pred_9 obj_08)
       (pred_9 obj_11)
       (pred_9 obj_03)
       (pred_9 obj_22)
       (pred_9 obj_23)
       (pred_9 obj_24)
       (pred_9 obj_25)
       (pred_9 obj_31)
       (pred_9 obj_07)
       (pred_9 obj_29)
       (pred_9 obj_27)
       (pred_9 obj_16)
       (pred_9 obj_28)
       (pred_9 obj_14)
       (pred_9 obj_15)
       (pred_9 obj_06)
       (pred_9 obj_10)
       (pred_9 obj_04)
       (pred_9 obj_09)
       (pred_9 obj_20)
       (pred_12 obj_12)
       (pred_12 obj_13)
       (pred_12 obj_05)
       (pred_1 obj_18)
       (pred_1 obj_17)
       (pred_1 obj_30)

       (pred_5 obj_02 obj_08)
       (pred_5 obj_02 obj_01)
       (pred_5 obj_01 obj_11)
       (pred_5 obj_01 obj_26)
       (pred_5 obj_01 obj_02)
       (pred_5 obj_26 obj_03)
       (pred_5 obj_26 obj_19)
       (pred_5 obj_26 obj_01)
       (pred_5 obj_19 obj_22)
       (pred_5 obj_19 obj_21)
       (pred_5 obj_19 obj_26)
       (pred_5 obj_21 obj_23)
       (pred_5 obj_21 obj_19)
       (pred_5 obj_08 obj_24)
       (pred_5 obj_08 obj_11)
       (pred_5 obj_08 obj_02)
       (pred_5 obj_11 obj_25)
       (pred_5 obj_11 obj_03)
       (pred_5 obj_11 obj_01)
       (pred_5 obj_11 obj_08)
       (pred_5 obj_03 obj_31)
       (pred_5 obj_03 obj_22)
       (pred_5 obj_03 obj_26)
       (pred_5 obj_03 obj_11)
       (pred_5 obj_22 obj_07)
       (pred_5 obj_22 obj_23)
       (pred_5 obj_22 obj_19)
       (pred_5 obj_22 obj_03)
       (pred_5 obj_23 obj_29)
       (pred_5 obj_23 obj_21)
       (pred_5 obj_23 obj_22)
       (pred_5 obj_24 obj_27)
       (pred_5 obj_24 obj_25)
       (pred_5 obj_24 obj_08)
       (pred_5 obj_25 obj_16)
       (pred_5 obj_25 obj_31)
       (pred_5 obj_25 obj_11)
       (pred_5 obj_25 obj_24)
       (pred_5 obj_31 obj_28)
       (pred_5 obj_31 obj_07)
       (pred_5 obj_31 obj_03)
       (pred_5 obj_31 obj_25)
       (pred_5 obj_07 obj_14)
       (pred_5 obj_07 obj_29)
       (pred_5 obj_07 obj_22)
       (pred_5 obj_07 obj_31)
       (pred_5 obj_29 obj_15)
       (pred_5 obj_29 obj_23)
       (pred_5 obj_29 obj_07)
       (pred_5 obj_27 obj_06)
       (pred_5 obj_27 obj_16)
       (pred_5 obj_27 obj_24)
       (pred_5 obj_16 obj_10)
       (pred_5 obj_16 obj_28)
       (pred_5 obj_16 obj_25)
       (pred_5 obj_16 obj_27)
       (pred_5 obj_28 obj_04)
       (pred_5 obj_28 obj_14)
       (pred_5 obj_28 obj_31)
       (pred_5 obj_28 obj_16)
       (pred_5 obj_14 obj_09)
       (pred_5 obj_14 obj_15)
       (pred_5 obj_14 obj_07)
       (pred_5 obj_14 obj_28)
       (pred_5 obj_15 obj_20)
       (pred_5 obj_15 obj_29)
       (pred_5 obj_15 obj_14)
       (pred_5 obj_06 obj_10)
       (pred_5 obj_06 obj_27)
       (pred_5 obj_10 obj_04)
       (pred_5 obj_10 obj_16)
       (pred_5 obj_10 obj_06)
       (pred_5 obj_04 obj_09)
       (pred_5 obj_04 obj_28)
       (pred_5 obj_04 obj_10)
       (pred_5 obj_09 obj_20)
       (pred_5 obj_09 obj_14)
       (pred_5 obj_09 obj_04)
       (pred_5 obj_20 obj_15)
       (pred_5 obj_20 obj_09)
       (pred_10 obj_06)
       (pred_10 obj_21)
       (pred_10 obj_28)
       (pred_3  obj_06 obj_12)
       (pred_3  obj_21 obj_13)
       (pred_3  obj_28 obj_05)
       (pred_6 obj_02)
       (pred_6 obj_01)
       (pred_6 obj_26)
       (pred_6 obj_19)
       (pred_6 obj_08)
       (pred_6 obj_11)
       (pred_6 obj_03)
       (pred_6 obj_22)
       (pred_6 obj_23)
       (pred_6 obj_24)
       (pred_6 obj_25)
       (pred_6 obj_31)
       (pred_6 obj_07)
       (pred_6 obj_29)
       (pred_6 obj_27)
       (pred_6 obj_16)
       (pred_6 obj_14)
       (pred_6 obj_15)
       (pred_6 obj_10)
       (pred_6 obj_04)
       (pred_6 obj_09)
       (pred_6 obj_20)

       (pred_7  obj_18 obj_12)
       (pred_7  obj_17 obj_13)
       (pred_7  obj_30 obj_05)
       (pred_4 obj_18 obj_07)
       (pred_4 obj_17 obj_02)
       (pred_4 obj_30 obj_20)
       (pred_8 obj_10)
    )

    (:goal (and
       (pred_4 obj_18 obj_10)
    ))
(:constraints
  (always (not (pred_8 obj_16)))
)
)

; plan
1. (op_4 obj_10 obj_04)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_04)
   goals met: 0 of 1
2. (op_4 obj_04 obj_09)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_09)
   goals met: 0 of 1
3. (op_4 obj_09 obj_14)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_14)
   goals met: 0 of 1
4. (op_4 obj_14 obj_07)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_07)
   goals met: 0 of 1
5. (op_1 obj_07 obj_18)
   deleted: (pred_4 obj_18 obj_07) (pred_11)
   added: (pred_2 obj_18)
   goals met: 0 of 1
6. (op_4 obj_07 obj_14)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_14)
   goals met: 0 of 1
7. (op_4 obj_14 obj_09)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_09)
   goals met: 0 of 1
8. (op_4 obj_09 obj_04)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_04)
   goals met: 0 of 1
9. (op_4 obj_04 obj_10)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_10)
   goals met: 0 of 1
10. (op_3 obj_10 obj_18)
   deleted: (pred_2 obj_18)
   added: (pred_11) (pred_4 obj_18 obj_10)
   goals met: 1 of 1
